## Minh họa Pandas - DataFrame

In [ ]:
# Import thư viện
import numpy as np
import pandas as pd

### Tạo DataFrame

In [ ]:
#Tạo dataframe từ list

#df1=pd.DataFrame(['1','2','3'])
#df1

#df1=pd.DataFrame([['An','19'],['Hoa',25]])
#df1

df1=pd.DataFrame([['An','19'],['Hoa',25]],columns=['Ten','Tuoi'])
df1

   Ten Tuoi
0   An   19
1  Hoa   25

In [ ]:
#Tạo dataframe từ list dictionary

#df2 = pd.DataFrame([{'Ten':'An','Tuoi':19},{'Ten':'Hoa','Tuoi':25}])
#df2

#df2 = pd.DataFrame({'Ten':['An','Hoa'],'Tuoi':[19,25]})
#print(df2)

df2 = pd.DataFrame({'Ten':['An','Hoa','Trung'],'Tuoi':[19,25]}) 
df2

#df2 = pd.DataFrame([{'Ten':'An','Tuoi':19},{'Ten':'Hoa','Tuoi':25},{'Ten': 'Trung'}])
#print(df2)

   Ten  Tuoi
0   An  19.0
1  Hoa   NaN

In [ ]:
#Tạo data frame từ list dictionary 
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
# 2 cột, tên cột là tên key của dictionary
#df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

# 2 cột, tên một cột là tên key của dictionary, tên một cột khác
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'c'])
df2
#print(df2)

        a     c
first   1   NaN
second  5  20.0

In [ ]:
#df21 = pd.DataFrame(data, index=['first', 'second'])
#print(df21)

#df22 = pd.DataFrame(data)
#print(df22)

In [ ]:
#Tạo dataframe từ dictionary series

#Tạo dataframe từ dictionary series
data={'Ten':pd.Series(['Hoa','An','Trung']), 'Tuoi':pd.Series([19,25,40])}
#df3 = pd.DataFrame(data)

#print(df3)
#print(df3.dtypes)

### Thao tác trên cột: lấy dữ liệu, thêm cột, xóa cột

In [ ]:
# Create a DataFrame from Dict of Series
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
      'three' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
    }

df5 = pd.DataFrame(d, columns = ['one', 'two', 'three'])
df5

   one  two  three
a  1.0    1    1.0
b  2.0    2    2.0
c  3.0    3    3.0
d  NaN    4    NaN

In [ ]:
# lấy dữ liệu theo cột
print(df5)
print("Lấy cột 'one':")
print(df5['one'])
print(df5.one)

   one  two  three
a  1.0    1    1.0
b  2.0    2    2.0
c  3.0    3    3.0
d  NaN    4    NaN
Lấy cột 'one':
a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64
a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [ ]:
# Thêm cột mới

df5['four']=pd.Series([10,20,30, 40],
                      index=['a','b','c','d1'])
print(df5)

   one  two  three  four
a  1.0    1    1.0  10.0
b  2.0    2    2.0  20.0
c  3.0    3    3.0  30.0
d  NaN    4    NaN   NaN

In [ ]:
# using del function
print ("Dùng del:")
del df5['three']
print(df5)

Dùng del:
   one  two  four
a  1.0    1  10.0
b  2.0    2  20.0
c  3.0    3  30.0
d  NaN    4   NaN

In [ ]:
#using drop
print(df5)
df7=df5.drop(labels=['two','four'], axis=1)
print(df7)

In [ ]:
# Xóa cột



# using pop function
print(df5)
print ("Dùng pop để xóa cột one")
df6=df5.pop('one')
print(df5)
print ("df6") # df6 chứa cột  bị xóa
print(df6)

   one  two  four
a  1.0    1  10.0
b  2.0    2  20.0
c  3.0    3  30.0
d  NaN    4   NaN
Dùng pop để xóa cột one
   two  four
a    1  10.0
b    2  20.0
c    3  30.0
d    4   NaN
df6
a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [ ]:
print(df5)

# Thao tác trên dòng: lấy dữ liệu, thêm dòng, xóa dòng

In [ ]:
# lấy dữ liệu trên dòng loc- iloc

d = {'name' : pd.Series(['An', 'Hoa', 'Trung','Huy','Thanh','Dung'], index=[49,48,47, 1, 2, 3]),
      'age' : pd.Series([15, 22, 36,27,55],index=[49,48,47, 1, 3])
    }
                         
df=pd.DataFrame(d,columns=['name','age'])
print('Dataframe\n',df)

## Lấy dữ liệu theo loc - iloc

#loc

print('Giá trị dòng 3- cột name là:', df.loc[3,'name'])

#iloc
print('Giá trị dòng index 3- cột name là:',df.iloc[3,0])
print('Giá trị dòng index 4- cột age là:',df.iloc[4,1])

print('Lọc những nhân viên có tuổi >30: \n',  df.loc[df['age']>30])

print('Lọc tên những nhân viên có tuổi >30: \n', df.loc[df['age']>30,'name'])

Dataframe
      name   age
1     Huy  27.0
2   Thanh   NaN
3    Dung  55.0
47  Trung  36.0
48    Hoa  22.0
49     An  15.0
Giá trị dòng 3- cột name là: Dung
Giá trị dòng index 3- cột name là: Trung
Giá trị dòng index 4- cột age là: 22.0
Lọc những nhân viên có tuổi >30:
      name   age
3    Dung  55.0
47  Trung  36.0
Lọc tên những nhân viên có tuổi >30:
 3      Dung
47    Trung
Name: name, dtype: object

In [ ]:
#Cập nhật dữ liệu
print(df)
print (' Trước khi cập nhật: ', df.loc[df['name']=='Huy'].age.values[0])

df.loc[df['name']=='Huy','age'] = 37

print (' Sau khi cập nhật: ', df.loc[df['name']=='Huy'].age.values[0])

In [ ]:
# Minh họa set_index
print(df)
df4 = df.set_index(keys=['name'])
df4

In [ ]:
print('Tuổi của nhân viên Huy :',df4.loc['Huy','age'])

### Sắp xếp

In [ ]:
data = [['Alex',23],['Jack',27],['Clarke',32]]
df5 = pd.DataFrame(data,index=[2,0,1], columns=['Name','Age'],dtype=float)
df5

     Name   Age
2    Alex  23.0
0    Jack  27.0
1  Clarke  32.0

In [ ]:
#Sắp df theo index
#df5.sort_index(ascending=False)

# sắp xếp theo cột
df5.sort_index(axis=1)

    Age    Name
2  23.0    Alex
0  27.0    Jack
1  32.0  Clarke

In [ ]:
#Sắp theo giá trị
# Sắp tên tăng dần
#df5.sort_values(by='Name', ascending=False)

# Sắp tuổi giảm dần
#df5.sort_values(by='Age', ascending=False)

#df5 = df5.append({'Name': 'Alex', 'Age': 20}, ignore_index=True)
#df5
# Sắp Name tăng dần , Age giảm dần
df5.sort_values(by=['Name','Age'], ascending=[True,False])

     Name   Age
0    Alex  23.0
3    Alex  20.0
2  Clarke  32.0
1    Jack  27.0

In [ ]:
#Xếp hạng các giá trị dữ liệu trong các cột của dataframe

print(df5)
print('Xếp hạng\n',df5.rank(method='min'))

     Name   Age
0    Alex  23.0
1    Jack  27.0
2  Clarke  32.0
3    Alex  20.0
Xếp hạng
    Name  Age
0   1.0  2.0
1   4.0  3.0
2   3.0  4.0
3   1.0  1.0

In [ ]:
print (df)

In [ ]:
df['ratio'] = pd.Series([2.2 ,1.5, 2.5 , 5,  1.2,3.4],index=[49,48,47, 1, 2, 3])
df

     name   age  ratio
1     Huy  27.0    5.0
2   Thanh   NaN    1.2
3    Dung  55.0    3.4
47  Trung  36.0    2.5
48    Hoa  22.0    1.5
49     An  15.0    2.2

In [ ]:
df['salary'] = df['ratio'] * 200000
df

     name   age  ratio     salary
1     Huy  27.0    5.0  1000000.0
2   Thanh   NaN    1.2   240000.0
3    Dung  55.0    3.4   680000.0
47  Trung  36.0    2.5   500000.0
48    Hoa  22.0    1.5   300000.0
49     An  15.0    2.2   440000.0

In [ ]:
df['age_group'] = df['age'].map(lambda x: 1 if x> 30 else 2)
df

     name   age  ratio     salary  age_group
1     Huy  27.0    5.0  1000000.0          2
2   Thanh   NaN    1.2   240000.0          2
3    Dung  55.0    3.4   680000.0          1
47  Trung  36.0    2.5   500000.0          1
48    Hoa  22.0    1.5   300000.0          2
49     An  15.0    2.2   440000.0          2

In [ ]:
df.any()

In [ ]:
df.all()

In [ ]:
import pandas as pd
x = pd.DataFrame(['a','b','c'])
x

In [ ]:
y=x.copy()
y

In [ ]:
y.loc[0,0]='z'
y

In [ ]:
x